[{"title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}, {"title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"title": "NASA's Curiosity Mars Rover Takes a New Selfie Before Record Climb", "preview": "Along with capturing an image before its steepest ascent ever, the robotic explorer filmed its \"selfie stick,\" or robotic arm, in action."}, {"title": "New Selfie Shows Curiosity, the Mars Chemist", "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."}, {"title": "NASA's Mars 2020 Comes Full Circle", "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA's Mars Perseverance Rover Gets Its Sample Handling System", "preview": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."}, {"title": "Naming a NASA Mars Rover Can Change Your Life", "preview": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."}, {"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}, {"title": "NASA's Perseverance Mars Rover Gets Balanced", "preview": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."}, {"title": "Independent Review Indicates NASA Prepared for Mars Sample Return Campaign", "preview": "NASA released an independent review report Tuesday indicating the agency is well positioned for its Mars Sample Return campaign to bring pristine samples from Mars to Earth for scientific study."}]